app/controllers/feasts_controller.rb

SELECT "feasts".* FROM "feasts"
---
  def index
    @feasts = Feast.all

INSERT INTO "feasts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sushi"], ["created_at", "2015-04-07 11:59:15.855235"], ["updated_at", "2015-04-07 11:59:15.855235"]]
---
  def create
    feast = Feast.new
    current_user.create_feast(feast_params)

SELECT  "feasts".* FROM "feasts" WHERE "feasts"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @feast = Feast.find(params[:id])

SELECT  "feasts".* FROM "feasts" WHERE "feasts"."id" = $1 LIMIT 1  [["id", 32]]
---
  def edit
    @feast = Feast.find(params[:id])

SELECT  "feasts".* FROM "feasts" WHERE "feasts"."id" = $1 LIMIT 1  [["id", 40]]
UPDATE "feasts" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "feasts"."id" = $5  [["address", "Spitalfields Market"], ["latitude", 51.555077], ["longitude", -0.016453], ["updated_at", "2015-04-08 10:18:41.162259"], ["id", 2]]
---
  def update
    @feast = Feast.find(params[:id])
    @feast.update(feast_params)

SELECT  "feasts".* FROM "feasts" WHERE "feasts"."id" = $1 LIMIT 1  [["id", 65]]
DELETE FROM "feasts" WHERE "feasts"."id" = $1  [["id", 65]]
---
  def destroy
    @feast = Feast.find(params[:id])
    if @feast.user_id == current_user.id
      @feast.destroy