app/controllers/reviews_controller.rb

  def new
    @feast = Feast.find(params[:feast_id])
---
SELECT  "feasts".* FROM "feasts" WHERE "feasts"."id" = $1 LIMIT 1  [["id", 24]]

  def create
    @feast = Feast.find(params[:feast_id])
    if !current_user.has_reviewed? @feast
      @review = @feast.create_review(current_user, review_params)
---
SELECT  "feasts".* FROM "feasts" WHERE "feasts"."id" = $1 LIMIT 1  [["id", 48]]
INSERT INTO "reviews" ("thoughts", "rating", "feast_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "solid"], ["rating", 5], ["feast_id", 69], ["user_id", 77], ["created_at", "2015-04-09 10:43:50.519910"], ["updated_at", "2015-04-09 10:43:50.519910"]]