app/views/feasts/index.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."feast_id" = $1 LIMIT 1  [["feast_id", 37]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."feast_id" = $1  [["feast_id", 42]]
---
      <% end %>
      <% if feast.reviews.any? %>