app/views/feasts/show.html.erb


<% if @feast.reviews.any? %>
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."feast_id" = $1 LIMIT 1  [["feast_id", 51]]